packages/windmapper/windmapper-2.1.3-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.3.data/data/share/windninja/ninjafoam/8/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains    $nProc$;

method           simple;

simpleCoeffs
{
    n                   ($nProc$ 1 1 );
    delta               0.001;
}

hierarchicalCoeffs
{
    n               (2 1 1 );
    delta           0.001;
    order           xyz;
}

scotchCoeffs
{
    processorWeights
    (
        1 1 1 1 1 1
    );
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots
(
);

// ************************************************************************* //
